Revit 2027 API
TextNode.HorizontalAlignment Property
 Indicates default horizontal alignment of the text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HorizontalTextAlignment HorizontalAlignment { get; }
Public ReadOnly Property HorizontalAlignment As HorizontalTextAlignment
	Get
public:
property HorizontalTextAlignment HorizontalAlignment {
	HorizontalTextAlignment get ();
}
member HorizontalAlignment : HorizontalTextAlignment with get
Property Value
HorizontalTextAlignment
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace